0.1.0/tutorials/incompressible/simple/turbine_siting/system/blockMeshDict
// mousse: CFD toolbox

FoamFile
{
  version         2.0;
  format          ascii;
  class           dictionary;
  object          blockMeshDict;
}

convertToMeters 1;
vertices
(
  ( 581321  4.78537e+06   930)
  ( 582290  4.78537e+06   930)
  ( 582290  4.78624e+06   930)
  ( 581321  4.78624e+06   930)
  ( 581321  4.78537e+06   1500)
  ( 582290  4.78537e+06   1500)
  ( 582290  4.78624e+06   1500)
  ( 581321  4.78624e+06   1500)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (30 30 20) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
  outlet
  {
    type patch;
    faces
    (
      (2 6 5 1)
    );
  }
  sides
  {
    type patch;
    faces
    (
      (1 5 4 0)
      (3 7 6 2)
    );
  }
  inlet
  {
    type patch;
    faces
    (
      (0 4 7 3)
    );
  }
  ground
  {
    type wall;
    faces
    (
      (0 3 2 1)
    );
  }
  top
  {
    type patch;
    faces
    (
      (4 5 6 7)
    );
  }
);
mergePatchPairs
(
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
