0.1.0/tutorials/incompressible/simple/turbine_siting/0.org/epsilon
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
#include        "include/initialConditions"
internalField   uniform $turbulentEpsilon;

boundaryField
{
  terrain
  {
    type            epsilonWallFunction;
    Cmu             0.09;
    kappa           0.4;
    E               9.8;
    value           $internalField;
  }
  outlet
  {
    type            inletOutlet;
    inletValue      uniform $turbulentEpsilon;
    value           $internalField;
  }
  inlet
  {
    type            atmBoundaryLayerInletEpsilon;
    #include        "include/ABLConditions"
  }
  ground
  {
    type            zeroGradient;
  }
  #include "include/sideAndTopPatches"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
