0.1.0/tutorials/incompressible/simple/turbine_siting/0.org/include/ABLConditions
Uref                 10.0;
Zref                 20;
zDir                 (0 0 1);
flowDir              (1 0 0);
z0                   uniform 0.1;
zGround              uniform 935.0;
value                $internalField;

