0.1.0/tutorials/incompressible/simple/turbine_siting/0.org/include/fixedInlet
inlet
{
    type  fixedValue;
    value $internalField;
}

// vim: ft=foam et sw=2 ts=2 sts=2
