0.1.0/tutorials/incompressible/simple/turbine_siting/0.org/include/sideAndTopPatches

top
{
    type slip;
}

sides
{
    type slip;
}

"proc.*"
{
    type            processor;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
