0.1.0/tutorials/incompressible/simple/turbine_siting/0.org/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      k;
}

#include        "include/initialConditions"
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform $turbulentKE;

boundaryField
{
  outlet
  {
    type            inletOutlet;
    inletValue      uniform $turbulentKE;
    value           $internalField;
  }
  inlet
  {
    type            atmBoundaryLayerInletK;
    #include        "include/ABLConditions"
  }
  terrain
  {
    type            kqRWallFunction;
    value           uniform 0.0;
  }
  ground
  {
    type            zeroGradient;
  }
  #include "include/sideAndTopPatches"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
