0.1.0/tutorials/incompressible/simple/turbine_siting/system/topoSetDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      topoSetDict;
}

actions
(
  // actuationDisk1
  {
    name    actuationDisk1CellSet;
    type    cellSet;
    action  new;
    source  boxToCell;
    sourceInfo
    {
      box (581850.5 4785805 1061) (581850.8 4785815 1071);
    }
  }
  {
    name    actuationDisk1;
    type    cellZoneSet;
    action  new;
    source  setToCellZone;
    sourceInfo
    {
      set actuationDisk1CellSet;
    }
  }
  // actuationDisk2
  {
    name    actuationDisk2CellSet;
    type    cellSet;
    action  new;
    source  boxToCell;
    sourceInfo
    {
      box (581754 4785658 1065) (581754.4 4785668 1075);
    }
  }
  {
    name    actuationDisk2;
    type    cellZoneSet;
    action  new;
    source  setToCellZone;
    sourceInfo
    {
      set actuationDisk2CellSet;
    }
  }
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
